export type LayoutName = 'default' | 'eng' | 'symbols';


export const layouts = {
    default: [
        ['й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ'],
        ['ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э'],
        ['word-arrow', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', 'word-delete'],
        ['&123', 'translate', 'Пробел', 'Ввод'],
    ],
    eng: [
        ['q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p'],
        ['a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l'],
        ['word-arrow', 'z', 'x', 'c', 'v', 'b', 'n', 'm', 'word-delete'],
        ['&123', 'translate', 'Space', 'Enter'],
    ],
    symbols: [
        ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'],
        ['-', '/', ':', ';', '(', ')', '₽', '&', '@'],
        ['.', ',', '?', '!', '\'', 'word-delete'],
        ['ABC', 'АБВ', 'Space', 'Ввод'],
    ],
};

