export type LayoutName = 'default' | 'symbols';


export const layouts = {
    default: [
        ['й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ'],
        ['ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э'],
        ['word-arrow', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', 'word-delete'],
        ['&123', 'Пробел', 'Ввод'],
    ],
    symbols: [
        ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'],
        ['-', '/', ':', ';', '(', ')', '₽', '&', '@'],
        ['.', ',', '?', '!', '\'', 'word-delete'],
        [ 'АБВ', 'Пробел', 'Ввод'],
    ],
};

